src/Catalogs/ПравилаКонвертацииОбъектов/ПравилаКонвертацииОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииОбъектов</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.СМП_УчетныеЗаписиОбменов</owners>
  <attributes>
    <name>АлгоритмПередВыгрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗагрузкойОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеВыгрузкиОбъектаВФайлОбмена</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПоследовательностьПолейПоиска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗагрузкиОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриВыгрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПриЗагрузкеОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыгружатьОбъектТолькоПриНаличииНаНегоСсылки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГенерироватьНовыйНомерИлиКодЕслиНеУказан</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБыстрыйПоискПриЗагрузке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НеВыгружатьОбъектыСвойствПоСсылкам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗамещатьОбъектСозданныйВИнформационнойБазеПриемнике</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЗапоминатьВыгруженные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоздаватьОбъектВПриемникеЕслиНеНайденПоПолямПоиска</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.Объекты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриоритетОбъектовОбмена</name>
    <type>
      <types>EnumRef.ПриоритетОбъектовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СинхронизироватьПоИдентификатору</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкаВариантовПоискаОбъектов</name>
    <attributes>
      <name>ИмяНастройкиДляАлгоритма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписаниеНастройкиДляПользователя</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПравилаКонвертацииОбъектов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьИДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Редактор кода
	НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("ЗагрузитьРедакторКода", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Редактор кода
	//Объект.АлгоритмПередВыгрузкойОбъекта = Элементы.АлгоритмПередВыгрузкойОбъектаРедактор.Документ.defaultView.editor.getValue();
	//Объект.АлгоритмПриВыгрузкеОбъекта = Элементы.АлгоритмПриВыгрузкеОбъектаРедактор.Документ.defaultView.editor.getValue();
	//Объект.АлгоритмПослеВыгрузкиОбъекта = Элементы.АлгоритмПослеВыгрузкиОбъектаРедактор.Документ.defaultView.editor.getValue();
	//Объект.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена = Элементы.АлгоритмПослеВыгрузкиОбъектаВФайлОбменаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПоследовательностьПолейПоиска = Элементы.АлгоритмПоследовательностьПолейПоискаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПередЗагрузкойОбъекта = Элементы.АлгоритмПередЗагрузкойОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПриЗагрузкеОбъекта = Элементы.АлгоритмПриЗагрузкеОбъектаРедактор.Документ.defaultView.editor.getValue();
	Объект.АлгоритмПослеЗагрузкиОбъекта = Элементы.АлгоритмПослеЗагрузкиОбъектаРедактор.Документ.defaultView.editor.getValue();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФорм

&НаКлиенте
Процедура СинхронизироватьПоИдентификаторуПриИзменении(Элемент)
	УстановитьВидимостьИДоступность();
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выполняет установку видимости и доступности элементов формы.
//
&НаСервере
Процедура УстановитьВидимостьИДоступность()
	
	Элементы.ПродолжитьПоискПоПолямПоискаЕслиПоИдентификаторуНеНашли.Доступность = Объект.СинхронизироватьПоИдентификатору;
	Элементы.ПриПереносеОбъектаПоСсылкеУстанавливатьТолькоGIUD.Доступность = Объект.СинхронизироватьПоИдентификатору;
	
КонецПроцедуры //УстановитьВидимость

// Редактор кода
&НаКлиенте
Процедура ЗагрузитьРедакторКода(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	//СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПередВыгрузкойОбъектаРедактор", Объект.АлгоритмПередВыгрузкойОбъекта, ИмяКаталогаВременныхФайлов);
	//СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПриВыгрузкеОбъектаРедактор", Объект.АлгоритмПриВыгрузкеОбъекта, ИмяКаталогаВременныхФайлов);
	//СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПослеВыгрузкиОбъектаРедактор", Объект.АлгоритмПослеВыгрузкиОбъекта, ИмяКаталогаВременныхФайлов);
	//СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПослеВыгрузкиОбъектаВФайлОбменаРедактор", Объект.АлгоритмПослеВыгрузкиОбъектаВФайлОбмена, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПоследовательностьПолейПоискаРедактор", Объект.АлгоритмПоследовательностьПолейПоиска, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПередЗагрузкойОбъектаРедактор", Объект.АлгоритмПередЗагрузкойОбъекта, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПриЗагрузкеОбъектаРедактор", Объект.АлгоритмПриЗагрузкеОбъекта, ИмяКаталогаВременныхФайлов);
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтаФорма, "АлгоритмПослеЗагрузкиОбъектаРедактор", Объект.АлгоритмПослеЗагрузкиОбъекта, ИмяКаталогаВременныхФайлов);
	
КонецПроцедуры

#КонецОбласти
